app/controllers/pictures_controller.rb

INSERT INTO "pictures" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Ocean One"], ["description", "Nice Picture i took."], ["created_at", "2015-11-10 02:37:06.093194"], ["updated_at", "2015-11-10 02:37:06.093194"]]
---
  def create
    @picture = Picture.new(picture_params)

    respond_to do |format|
      if @picture.save

UPDATE "pictures" SET "image_updated_at" = ?, "image_file_name" = ?, "updated_at" = ? WHERE "pictures"."id" = ?  [["image_updated_at", "2015-11-10 03:29:45.214366"], ["image_file_name", "photo-1443527216320-7e744084f5a7.jpg"], ["updated_at", "2015-11-10 03:29:45.392196"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @picture.update(picture_params)